# ============================= 1 =====================================
# من یه کاراکتر رو از کاربر بپرسم و برم بشمارم ببیم چد تاس
# s = 'reza is a bad boy hi how are you'
# c = input("enter a char: ")
# print(s.count(c))
# ============================= 2 =====================================
# یه جمله از کاربر بگیریم و اخرین کلمشو  نشون بدیم
# s = input('enter a string: ')
# s = s.rstrip(' ')
# i = s.rfind(' ')
# print(s[i+1:])
# ============================= 3 =====================================
# دوتا جمله از کاربر میگیرم و بررسی میکنیم جلمه دوم کلماتش توی جمله اولش هست یا نه
# s1 = input('enter a string1: ')
# s2 = input('enter a string2: ')
# print(s2 in s1)
# ============================= 4 =====================================
# میخایم جمله که کاربر وارد کرده رو تمام اسپیس هاشو پاک کنیم
# s = input('enter a string: ')
# print(s.replace(' ', '').replace('\t', ''))
# ============================= 5 =====================================
# کاربر یه شماره تلفنی رو به شکل رشته وارد کرده و من میخام شماره هایی که وارد کرده 0هارو از اولش پاک کنم
# phone_number = input('enter your phone number: ')
# print(phone_number.lstrip('0'))
# =====================================================================
