# shallow copy ==> کپی سطحی
# deep copy ==> کپی عمیق
# ----------------------------------------------------------------------------------
# x_1 = 10
# x_2 = x_1
# print(x_1, id(x_1))
# print(x_2, id(x_2))
# x_2 += 1
# print(x_1, id(x_1))
# print(x_2, id(x_2))
# ----------------------------------------------------------------------------------
# li_1 = [1, 2, 3, 4, 5]
# li_2 = li_1  # اینجا کپی بالای اینجا قرار نگرفته بلکه ادرسش قرار گرفته برای همین اگر تغییری در این انجام بدیم در بالای هم ایجاد میشه
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# li_2[0] = 0
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# ----------------------------------------------------------------------------------
# li_1 = [1, 2, 3, 4, 5]
# li_2 = li_1[:]  #   اینجا کپی li_1 توی li_2 قرار گرفته
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# li_2[0] = 0
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# ----------------------------------------------------------------------------------
# li_1 = [1, 2, 3, 4, 5]
# li_2 = li_1.copy()  #   اینجا کپی li_1 توی li_2 قرار گرفته
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# li_2[0] = 0
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# ----------------------------------------------------------------------------------
# x = [1, 2, 3, 4, 5, ['a', 'b', [1.1, 1.2, 1.3, 'reza', 'dolati'], 'c'], 6]
# print(x[5][2][3])
# print(x[5][2][3][0])
# ----------------------------------------------------------------------------------
# li_1 = [1, 2, ['a', 'b']]
# li_2 = li_1.copy()
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# li_2[2][0] = 0  # اینجا فقط گفتم که a  در li_2 تغییر کنه ولی در li_1 هم تغییر کرده
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# ----------------------------------------------------------------------------------
# from copy import deepcopy
# li_1 = [1, 2, ['a', 'b']]
# li_2 = deepcopy(li_1)
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# li_2[2][0] = 0
# print(li_1, id(li_1))
# print(li_2, id(li_2))
# ----------------------------------------------------------------------------------
