# x = 5
# y = 4.5
# z = 7 + 6j
# print(type(x))
# print(type(y))
# print(type(z))
# --------------------------------------------------------------------------------------
# x = 0b10001101011  # اعداد بر مبنای 2 است و با 0 b شروع میشه
# print(bin(55))  # برای تبدیل اعداد دسیمال به باینری از این تابع استفاده میکنیم
# print(x, type(x))
# --------------------------------------------------------------------------------------

# x = 0o7607  # اعداد بر برمبنای 8 هست و با 0o شروع میشه
# print(oct(423))  # برای تبدیل اعداد دسیمال به اکتا از این تابع استفاده میکنیم
# print(x, type(x))
# --------------------------------------------------------------------------------------

# x = 0x978abcdef  # اعداد بر مبنای 16 هست و با 0x شروع میشه
# print(hex(50))  # برای تبدیل اعداد دسیمال به هکسا از این تابع استفاده میکنیم
# print(x, type(x))
# --------------------------------------------------------------------------------------
# x = 5
# y = 5.5
# z = 9.5
#
# x = float(x)
# y = int(y)
# z = complex(z)
#
# print(x)
# print(y)
# print(z)
# --------------------------------------------------------------------------------------
# from decimal import Decimal

# x = float(Decimal('0.1') + Decimal('0.2'))
# print(x, type(x), sep="  |  ")
# print(x == 0.3)
# --------------------------------------------------------------------------------------
# x = 1000_000_000_000
# print(x)
# --------------------------------------------------------------------------------------
# نماد عملی

# f = 1e+7  # 1 * 10 **7
# x = 5e+13  # 5 * 10 ** 13
# print(x)
# --------------------------------------------------------------------------------------
# x = 1 + 3j  # قسمت مهومی و قسمت حقیقی
# print(x, type(x), sep=" | ")
# print(x.real)  # قسمت حقیقی
# print(x.imag)  # قسمت محومی
# print(x.conjugate())  # مزدوج
# --------------------------------------------------------------------------------------
# c = 1 - 5j
# d = 4 + 9j
# print(c + d)
# --------------------------------------------------------------------------------------
# x = 55.5325214

# print(round(x, 3)) # رند کردن اعداد
# print(abs(x)) # قدر مطلق یه عددی
# print(pow(x, 3))  # به توان میرسونه
# --------------------------------------------------------------------------------------
