# keys ==> کلید های من هر نوع داده ای که غیر قابل تغییر باشن میتونه داشته باشه ==> string | number | tuple |
# value ==> میتونه هر نوع داده ای داشته باشه
# -----------------------------------------------------------
# d = {}
# print(d, type(d))
# -----------------------------------------------------------
# d = {'a': 2, 'b': 5}
# print(d['a'], d['b'])
# -----------------------------------------------------------
# d1 = {1: 55, 2: 5425}
# d2 = {"s": 55, "r": 5425}
# d3 = {(2,): 55, (33,): 5425}
# print(d1, '\n', d2, '\n', d3)
# -----------------------------------------------------------
# d1 = {'s': [55], "r": (5425,), 'a': {'a': 4}, 'b': 3, 'f': 'test'}
# print(d1)
# -----------------------------------------------------------
# d = {'a': 8, 'a': 55}  # اگه کلید هارو تکراری بزاری اون مقادیر اخری رو جایگزین میکنه
# print(d)
# -----------------------------------------------------------
# d = {'s': [55], "r": (5425,), 'a': {'a': 4}, 'b': 3, 'f': 'test'}
# print(d['r'], d['a'])
# d['f'] = 5555  # مقادیرشو اینجوری میتونی تغییر بدی
# print(d)
# d['z'] = 456  # اگر بخای این مقادیر رو عوض کنی ولی  کلیدش وجود نداشته باشه به دیکشنری اضافه میکنه
# print(d)
# print(d['g'])  # اگه این کلید وجود نداشته باشه ارور میده
# print(d.get('g'))  # اگه این کلید وجود نداشته باشه none برمیگردونه
# -----------------------------------------------------------
# d = {'s': [55, 33], "r": [11, 22, 33, 44, 55], 'c': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]}
# print(list(d.keys()))
# print(list(d.values()))
# print(list(d.items()))
