# d = {'a': 33, 'b': 66, 'c': 77}
# del d['a']
# d['a'] = 'danial'  # اینجوری میتونی مقادیر رو تغییر بدی
# print(d)
# ---------------------------------------------------------------------------------------------------------
#  با استفاده از این ترفند میتونی اسم کلید رو تغییر بدی
# d = {'a': 33, 'b': 66, 'c': 77}
# x = d['a']
# del d['a']
# d['x'] = x
# print(d)
# ---------------------------------------------------------------------------------------------------------
# li = [19, 12, 34, 24, 55]
# li = sorted(li)  # این تابع میاد مقادیر داخل لیست رو مرتب میکنه
# li = sorted(li, reverse=True)  # برعکس مرتب سازی میکنه
# print(li)
# ---------------------------------------------------------------------------------------------------------
# d = {'z': 33, 'a': 66, 'c': 77, 'd': 33, 't': 88}
# d = sorted(d.keys())  # کلید های من رو مرتب میکنه
# d = sorted(d.keys(), reverse=True)  # برعکس مرتب سازی میکنه
# print(d)
# ---------------------------------------------------------------------------------------------------------
# d = dict([('a', 3), ('b', 4), ('c', 5)])  # با استفاده از این تابع میتونیم دیکشنری تعریف کنیم
# d = dict(a=30, b=15, c=20)  # بااستفاده از این روش میتونیم دیکشنری تعریف کنیم
# print(d)
# ---------------------------------------------------------------------------------------------------------
# student = {
#     '170': {'name': 'danial', 'family': 'sadri', 'age': '17'},
#     '171': {'name': 'reza', 'family': 'dolati', 'age': '27'},
# }
# print(student['171'])
# print(student['171']['name'])
# print(student['171']['name'][0])
# print('170' in student)
# print('170' not in student)
# ---------------------------------------------------------------------------------------------------------
# from copy import deepcopy
#
# d_1 = {'a': 1, 'b': 2, 'c': 3}
# d_2 = deepcopy(d_1)
#
# print(d_1, id(d_1))
# print(d_2, id(d_2))
#
# d_2['a'] = 555
#
# print(d_1, id(d_1))
# print(d_2, id(d_2))
# ---------------------------------------------------------------------------------------------------------
# k = ['a', 'b', 'c']
# v = [1, 2, 3]
# print(list(zip(k, v)))
# print(dict(zip(k, v)))
