# ===================================================================================
# ست یا مجموعه : مجموعه شامل یه سری اشیایی هست که ویژگی یا صفات مشترک با هم دارن
# مجموعه ها قابل تغییرند یعنی میتونم یه سری عناصر رو ازش حذف کنم یا بهش اضافه کنم
# مجموعه ها عناصر تکراری قبول نمیکنند و عناصر تکراری رو حذف میکنند
# توی ست ترتیب نداریم
#  داخل مجموعه نمیتونی عنصری رو تعریف کنی که قابل تغییره مثل لیست
# ===================================================================================
# s = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
# print(id(s))
# s.add(22)
# print(id(s))
# print(s)
# ===================================================================================
# s = set()  # از تابع set برای ساخت مجموعه استفاده میشه
# print(s, type(s))
# ===================================================================================
# s = {1, 2, 3, [5, 55, 66, 77]} #  داخل مجموعه نمیتونی عنصری رو تعریف کنی که قابل تغییره مثل لیست
# print(s)
# ===================================================================================
# s = {1, 2, 3, 4, 5}
# s.update([66, 777, 888, 999, 123]) # استفاده میکنیم update  برای اضافه چند عنصر به  ست از متد
# print(s)
# ===================================================================================
#  با استفاده از متد remove  یا discard میتونم  یه عنصر رو حذف کنم
#  وقتی با متد remove  یه عنصر رو حذف میکنی اگه وجود نداشته باشه ارور میده ولی  با متد discard ارور نمیده

# s = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
# s.remove(1)
# s.discard(1)
# print(s)
# ===================================================================================
# s = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
# print(len(s))
# ===================================================================================
