# P = {3, 9, 15, 12, 6, 18}
# Q = {12, 18, 6, 10, 4, 16, 2, 8, 14}
# =================================== تفاضل دو مجموعه=============================
# print(P - Q)  # تمام مواردی رو نشون میده که توی p من هستن ولی توی q من نیستن
# print(Q - P)  # تمام مواردی رو نشون میده که توی q من هستن ولی توی p من نیستن
# print(P.difference(Q))
# print(Q.difference(P))
# ==================================اجتماع دو مجموعه===============================
# تمام مواردی که هم توی مجموعه q هم  توی مجموعه p هست با حذف تکراری ها
# print(P | Q)
# print(P.union(Q))
# ==================================اشتراک دو مجموعه ===============================
# تمام مواردی که هم توی p  هم توی q مشترک  هستند
# print(P & Q)
# print(P.intersection(Q))
# ==================================تفاضل متقارن ====================================
#  همه مواردی که هم توی q هم توی p هست به غیر از تکراری ها
# print(P ^ Q)
# print(Q.symmetric_difference(P))
# print((Q | P) - (Q & P))
# print((Q - P) | (P - Q))
# ===================================زیر مجموعه =====================================
# A = {40, 50, 20, 10, 30, 60}
# B = {10, 30, 60}

# print(B < A)  # هست یا نه b زیرمجموعه a
# print(B > A)  # b زیرمجموعه a هست یا نه
# print(A < B)  # b زیر مجموعه a هست یا نه
# print(A > B)  # a زیر مجموعه b هست یا نه
# print(A.issuperset(B))
# print(A.issubset(B))
# print(B.issuperset(A))
# print(B.issubset(A))
