# ===============================================================================
# میخایم با استفاده از لیست ها نام و نمرات یه دانشجو  رو دریافت و میانگین نمرانتشو چاپ کنیم
# marks = []
# name = input('name: ')
# marks.append(name)
# fizik = float(input('nomre fizik: '))
# marks.append(fizik)
# riazi = float(input('nomre riazi: '))
# marks.append(riazi)
# adabiyat = float(input('nomre adabiyat: '))
# marks.append(adabiyat)
# print(marks)
# ave = (marks[1] + marks[2] + marks[3]) / 3
# print(ave)
# ===============================================================================
# یه شماره تلفن از کاربر بگیریم بصورت رشته و همه اعداد اون بصورت رشته ذخیره کنیم توی یه لیست
# phone = input('phone: ')
# digit_list = list(phone)
# print(digit_list)
# ===============================================================================
#  دو تا لیست دارم خونه اخر لیست اولم رو با لیست دوم جایگزین کنم
# li_1 = [1, 2, 3, 4, 5]
# li_2 = ['a', 'b', 'c', 'd', 'e']
# li_1[-1:] = li_2
# print(li_1)
# ===============================================================================
# دوتا دانشجو داشته باشم اسم و نمره شون رو توی یه دیکشنری ذخیره کنم
# marks = {}
# name = input('name: ')
# mark = float(input('mark: '))
# marks[name] = mark
# name_1 = input('name 1: ')
# mark_1 = float(input('mark 1: '))
# marks[name_1] = mark_1
# print(marks)
# ===============================================================================
#  یه رشته بگیره از کاربر و بگه تعداد کاراکتر هایی که استفاده شده و خود کاراکتر هایی که استفاده شدن چیا هستن ولی تکراری هارو حساب نکنه
# s = input('Enter String: ')
# chs = set(s)
# print(chs, len(chs))
# ===============================================================================
