# ===============================================================================
"""
فرض کنید شما قرار است یک دیکشنری واقعی بنویسید. با استفاده از نوع داده دیکشنری ان را پیاده سازی کنید دقت کنید
که کلمه اصلی باید کلید دیکشنری باشد و معانی ان می توانند ییشتر از یک کلمه باشند. معانی را از کاربر بپرسید.
و بخشی به برنامه اضافه کنید تا یه کلمه رو از کاربر گرفته و معانی ان را از دیکشنری خوانده و نمایش بده
"""

# dictionary = {}
# key = input('word: ')
# meanings = input('meanings: ').split(',')
# dictionary[key] = meanings
#
# key = input('word: ')
# meanings = input('meanings: ').split(',')
# dictionary[key] = meanings
# print(dictionary)
# ===============================================================================
# word = input('your word: ')
# print('minings: ', dictionary.get(word))
# ===============================================================================
"""
دو لیست مختلف از شماره تلفن های افراد مختلف داریم. ممکن است بعضی از شماره تلفن ها در لیست تکراری باشند
 (مثلا 0939 در هر دو لیست وجود دارد) لیست جدیدی ایجاد کنید که دو لیست قبلی را ترکیب میکند ولی تکراری ها در ان وجود ندارند
 (از نوع داده مجموعه کمک بگیرید)
"""
# phones_1 = ['0939', '0914', '0903']
# phones_2 = ['0938', '0919', '0903']
# s = set(phones_1 + phones_2)
# print(s)
# ===============================================================================
