# اشیا زمانی فالس در نظر گرفته میشن که کاملا خالی باشن
# شی صفر(0, 0.0, 0j)
# False
# None
# ()
# ""
# []
# {}
# set()
# =============================================================================================
# None type = اگر اون متغیری که تعیین میکنم مقداری نداشته باشه  میتونم از none استفاده کنم
# n = None
# print(n, type(n))
# =============================================================================================
# boolean
# t = True
# f = False
# print(t, type(t))
# print(f, type(f))
# =============================================================================================
#  وقتی نوع بولین من تبدیل شد به اینتیجر میشه یک یا صفر
# t = True
# f = False
# print(t, int(t))
# print(f, int(f))
# =============================================================================================
# اینجا true, false ماهیت عدد بودنش رو داره
# t = True
# f = False
# print(t + 5)
# print(f + 5)
# print(t * 5)
# print(f * 5)
# print(t == 1)
# print(f == 0)
# =============================================================================================
