# وزن رو بر اساس کیلوگرم دریافت کنه و بر اساس گرم نمایش بده
# kg = int(input('Enter kg: '))
# g = kg * 1000
# print(g, 'g', sep='')
# ------------------------------------------------
# مساحت مثلث
# مساحت مثلث = قاعده * ارتفاع / 2
# مساحت مثلث = قاعده * ارتفاع * 0.5
# مساحت مثلث = قاعده * ارتفاع * 1/2
# x = int(input('Enter x: '))
# y = int(input('Enter y: '))
# s = 0.5 * x * y
# print('s: ', s)
# --------------------------------------------------
# ماشین حساب خیلی ساده
# x = int(input('x: '))
# y = int(input('y: '))
# print(x, '+', y, '=', x + y)
# print(x, '-', y, '=', x - y)
# print(x, '*', y, '=', x * y)
# print(x, '/', y, '=', x / y)
# --------------------------------------------------
# هر عددی باقیماندش به 10 میشه رقم اخرش
# هر عددی تقسیم (بدون اعشار) بر 10 رقم اخرش حذف میشه

# x = int(input('x: '))
# temp = x % 10
# print(temp)
# x = x // 10
# temp = x % 10
# print(temp)
# x = x // 10
# temp = x % 10
# print(x)
# --------------------------------------------------
# زاویه برحسب درجه تبدیل بشه به زاویه برحسب رادیان
# R = D * (3.14 / 180)

# d = int(input('d: '))
# r = d * (3.14/180)
# print('r: ', r)
