# ----------------------------------------------- 1 -------------------------------------------------------
# برنامه ای بنویسید که شعاع دایره رو از کاربر گرفته و محیط و مساحت دایره را چاپ کنید.
# C = 2pr # فرمول محیط دایره
# A = pr^2 # فرمول مساحت دایره
# r = float(input('r: '))
# p = 3.14
# print('mohit: ', 2 * p * r)
# print('masahat: ', p * r ** 2)
# ----------------------------------------------- 2 -------------------------------------------------------
# برنامه ای بنویسید که یک عدد از کاربر گرفته و مربع(توان دو) و مکعب(توان سوم) را چاپ کند
# x = int(input('x: '))
# print("x ^ 2 =", x ** 2)
# print("x ^ 3 =", x ** 3)
# ----------------------------------------------- 3 -------------------------------------------------------
# برنامه ای بنویسید که دو عدد از کاربر گرفته و اولی را به توان دومی برساند و نتیجه را چاپ کند
# x = int(input("x: "))
# y = int(input("y: "))
# print("x^y=", x ** y)
# ----------------------------------------------- 4 -------------------------------------------------------
# برنامه ای بنویسید که سه عدد گرفته و میانگین ان هارا محاسبه و چاپ کند
# x = int(input("x: "))
# y = int(input("y: "))
# z = int(input("z: "))
# print((x + y + z) / 3)
# --------------------------------------------------------------------------------------------------------
