# رشته : هر چیزی که با این دیدگاه بهش نگاه میکنیم که این یه متنه و یه کلمه هست یا این یه جملس
# ---------------------------------------------------------------------------------------------------------------
# x = 2
# print(isinstance(x, int))  # از این تابع استفاده میکنیم میتونیم بفهمم اون نوع داده ای که میخایم هست یا نه
# ---------------------------------------------------------------------------------------------------------------
# x = 2
# print(type(x))  # با استفاده از این تابع میتونیم نوع اون مقدار رو ببینیم
# ---------------------------------------------------------------------------------------------------------------
# x = 're\'za' # این بک اسلش کلا کارش لغو کردن یک دستوری که داخل رشته میتونیم استفاده کنیم
# print(x)
# ---------------------------------------------------------------------------------------------------------------
# x = 'reza dol\nati'  # با استفاده از n\ داخل رشته ای میره خط بعدی
# y = 'reza\tdolati'  # با استفاده از t\ داخل رشته ای یه تب میره جلو
# print(x, y, end="\n")
# ---------------------------------------------------------------------------------------------------------------
# x = 'C:\Downloads\\new'  # برای لغو کار بک اسلش هم از بک اسلش استفاده میکنیم
# x = r'C:\Downloads\new\t' # اگر بک اسلش ها زیاد بود میتونیم اولش یک r بزاریم
# print(x)
# ---------------------------------------------------------------------------------------------------------------
# x = """\
# ali
# daniel
# hossein \
# """
# print(x)
# ---------------------------------------------------------------------------------------------------------------
# x = 'reza'
# y = 'dolati'
# print(x + ' ' + y)
# print('reza' * 3)
# print("reza" "dolati" "01")
