# x = 'danielsadri'
# s = '43142'

# print(len(x))  # تعداد کاراکتر های اون رشته رو میگه
# print(x[0:len(x)])
# print(x.upper())
# print(x.lower())
# print(x.capitalize())
# print(x.count('i'))  # یه کاراکتر خاص رو بشماره و ببینه داخل این رشته چند بار تکرار شده
# print(x.endswith('i'))  # بررسی میکنه  این رشته ای که دارم با یه کاراکتر خاصی تموم شده یا نه
# print(x.startswith('d'))  # بررسی میکنه  این رشته ای که دارم با یه کاراکتر خاصی شروع شده یا نه
# print(x.find('l'))  # برای من یه کاراکتر خاص رو توی رشته سرچ میکنه از سمت چپ ایندکسش رو میاره
# print(x.rfind('s'))  # برای من یه کاراکتر خاص رو توی رشته سرچ میکنه از سمت راست ایندکسش رو میاره
# print(x.isalnum())  # میگه همه موارد و کاراکتر هایی که توی این رشته هست از عدد و حروف تشکیل شده یا نه
# print(s.isnumeric())  # بررسی میکنه که اینجا فقط فقط از اعداد استفاده شده یا نه
# ---------------------------------------------------------------------------
# x = '*'
# y = ["1", "2", "3"]
# print(x.join(y))
# ---------------------------------------------------------------------------
# x = "daniel,sadri,01"
# print(x.split(','))  # میاد اون رشته رو براساس اون چیزی که میخایم جدا میکنه
# ---------------------------------------------------------------------------
# s = 'daniel sadri 01'
# print(s.replace('d', '|'))  # میتونیم یه کاراکتر خاصیو با یه کاراکتر خاص جدا کنیم
# ---------------------------------------------------------------------------
# s = '----------daniel sadri 01-------'
# print(s)
# print(s.strip('-'))  # کارش اینه یه کاراکتر خاصیو از ابتدا و انتهای رشته حذف بکنه
# print(s.lstrip('-'))  # میاد یه کاراکتر خاصیو از ابتدا رشته حذف میکنه
# print(s.rstrip('-'))  # میاد یه کاراکتر خاصیو از انتها رشته حذف میکنه
# # ---------------------------------------------------------------------------
