# کاراکتر اسکیپ یا فرار | کاراکتر اسپشیال یا ویژه | کاراکتر های بک اسلش

# print('reza \'dolati')  # برای چاپ تک کتیشن از بک اسلش استفاده میکنیم
# print('reza \\tdolati')  # برای چاپ بک اسلش از بک اسلش استفاده میکنیم
# ------------------------------------------------------------------------------
# ASCII
# UNICODE

# print(ord('+'))  # با استفاده از این تابع میتونیم بفهمیم کد اسکی یا یونکدش چنده
# print(chr(123))  # با استفاده از این تابع عدد رو کاراکترشو میبینیم
# print('\u0489')  # با استفاده از u\ و یه عددی یا حروف که وارد کنیم میتونیم کاراکترشو ببینیم
# ------------------------------------------------------------------------------
# یه سری از کاراکتر ها رو که توی کیبورد نداریم چجوری چاپ کنیم؟

# print('\053')  # برمبنای 8
# print('\x2a')  # برمبنای 16
# print('hello\u000Areza')
# print('hello\x0areza')
# -------------------------------------------------------------------------------------
# print('hello\nreza')
# print('hello\treza')
# print('hello\breza')
# print('hello\rreza')
