#  دستورات کنترلی شامل تصمیم و تکرار هست
# تصمیم : یه سری شرط هایی بیان میکنیم و بر اساس برقرار بودن اون شرط یا برقرار نبودن اون شرط یه تصمیمی میگیریم
# =======================================================================================
# mark = int(input('mark: '))
#
# if 20 >= mark >= 15:
#     print('A')
# elif mark < 15 and mark >= 10:
#     print('B')
# elif mark < 10 and mark >= 5:
#     print('C')
# elif mark < 5 and mark >= 0:
#     print('D')
# else:
#     print('Wrong!')
#
# print('\n***End***')
