# x = int(input('x: '))
# =====================================================
# if x > 5:
#     print('Yes!')
# elif x == 7:
#     print('Hi')
# else:
#     print('No!')
# =====================================================
# if x > 5:
#     print('neda')
# if x == 7:
#     print('reza')
# if x <= 7:
#     print('ali')
# =====================================================
# mark = int(input('mark: '))
#
# if mark > 10:
#     print('Accepted!')
#     if 15 <= mark <= 20:
#         print('A')
#     elif 10 <= mark < 15:
#         print('B')
# else:
#     print('Rejected!')
# =====================================================
# y = 10
# x = 12 if y < 20 else 5
# print(x)
# =====================================================
#  مثالی برای زوج یا فرد بودن
# x = int(input('x: '))
#
# if x % 2 == 0:
#     print('even')
# else:
#     print('add')
# =====================================================
# بین دو عددی که کاربر وارد میکنه کدام از همه کوچک تره
# x = int(input('x: '))
# y = int(input('y: '))
# if x < y:
#     print('min is x!')
# else:
#     print('min is y!')
# =====================================================
# بین سه عددی که کاربر وارد میکنه کدام از همه کوچک تره

# x = int(input('x: '))
# y = int(input('y: '))
# z = int(input('z: '))
#
# Min = x
# if y < Min:
#     Min = y
# if z < Min:
#     Min = z
#
# print(Min)
# =====================================================
