# ==========================================================================================================
# یک عدد از کاربر بگیرید و بررسی کنید که هم بر 2 هم بر 5 بخش پذیر هست یا نه
# x = int(input('x: '))
# if x % 2 == 0 and x % 5 == 0:
#     print('Yes')
# else:
#     print('No')
# ==========================================================================================================
# اضلاع یک مثلث را از کاربر گرفته و مشخص کنید که ایا این  اضلاع تشکیل مثلث میدهند یا خیر؟ اگر جواب مثبت هست چه نوع مثلی؟
# (متساوی الساقین | مختلف الاضلاع |  قایم الزاویه | متساوی الاضلاع )

# x = int(input('x: '))
# y = int(input('y: '))
# z = int(input('z: '))

# if x < y + z and y < x + z and z < x + y:
#     print('mitavanad mosalas bashad.')
#     if x == y and y == z:
#         print('motesavi alazla ast.')  # اگر سه ضلع با هم برابر باشد
#     if x == y or y == z or x == z:
#         print('motesavi alsaghein ast.')  # اگر دو ضلع با هم برابر باشد کافیه
#     if x != y and y != z and x != z:
#         print('mokhtalef alasla ast.')  # هیچ کدام از اضلاع نباید با هم برابر باشند
#     if x ** 2 == y ** 2 + z ** 2 or y ** 2 == x ** 2 + z ** 2 or z ** 2 == y ** 2 + x ** 2:
#         print('ghaem alzavieh ast.')  # یک از اضلاع توان دو ان برابر باشه با جمع توان دو دو ضلع دیگه
# else:
#     print('nemitavanad mosalas bashad.')
# ==========================================================================================================
# یک کاراکتر از کاربر بگیرید و مشخص کنید کاراکتر وارد شده عدد هست, حروف انگلیسی هست یا سایر نماد ها.

# ch = input('Enter a char: ')
# if 48 <= ord(ch) <= 57:
#     print("your character is a number.")
# elif 65 <= ord(ch) <= 90 or 97 <= ord(ch) <= 122:
#     print("your character is a letter.")
# else:
#     print('Other')
# ==========================================================================================================
