# print(min(1, 2, 3, 43, 5324, 5, 36, 35, 6, 325, 63, 56, 3, 56, 3526, 3, 277, 463))
# print(min([], default=0))  # اگر لیست خالی بود مقدار دیفالت رو در نظر میگیره
# ------------------------------------------------------------------------------------------
# print(max([5432, 534, 6, 523, 2356, 25, 36, 236432542353, 632465, 632, 465, 32, 6352, 632], default=0))
# ------------------------------------------------------------------------------------------
"""
 براساس حروف الفبا میاد مقایسه میکنه مثلا min بزنید اون حرفی که جلوتر از بقیه هست میاد نشون میده max بزنید اون حرفی با حروف اخر الفبا نوشته شده نشون میده
"""
# print(max('ali', 'reza', 'neda', 'sahel'))
# print(min('ali', 'reza', 'neda', 'sahel'))
# ------------------------------------------------------------------------------------------
# print(sum([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], start=123))  # مقدار داخل لیست رو با start جمع میکنه
# ------------------------------------------------------------------------------------------
