"""
انتزاع :
انتزاع یعنی توجه به کلیات, بدون توجه زیاد به جزِییات
"""

"""
هرچقدر جزییات کمتر, سطح انتزاع بالاتر
"""

"""
نکته: خود کلاس یه دید انتزاعی هست به یک شی 
"""

"""
حالا اگر بخایم به خود کلاس انتزاعی تر نگاه کنم خود کلاس رو کلی تر نگاه کنم به این مفهوم کلاس انتزاعی یا abstract classs میگیم
"""

"""
concrete class : ..کلاس هایی که قابل نمونه سازی باشن مثل کلاس ماهی یا گربه و
"""

"""
abstract class: کلاس انتزاعی که قابل پیاده سازی نیست خودش مثلا کلاس حیوان رو نمیتونی پیاده سازی کنی
"""

"""
method abstract: متدی هست که اعلان میشه یعنی تعریف میشه ولیی بدنش پیاده سازی نمیشه
 چرا چون کلاس های جزیی تر که قراره از اینها ارث بری کنن میان برای خودشون این متد رو شخصی سازی کنن
"""
