# همه چیز در پایتون یک شی هست
"""
متا کلاس چیه؟؟؟
متا کلاس کلاسی هست که اشیایی که ازش ساخته میشن خودشون کلاسن
یعنی تایپ اینجا متاکلاسه
"""


# ==========================================================================
# class Human:
#     pass


# human_obj = Human() #  ابجکت از کلاس هیومن ساختم
# print(type(human_obj))  # نوع کلاس هیومن ابجکت رو بررسی میکنم
# print(isinstance(human_obj, Human))  # بررسی میکنه که هیومن ابجکت نوعی از کلاس هیومن هست یا نه
# print(Human.__base__) # بصورت دیفالف همه کلاس در پایتون از کلاس ابجکت ارث بری میکنن و با متد بیس میتونیم پایه های اون کلاس رو ببینیم
# print(type(Human))  # همه چیز در پایتون یک شی هست و حتی کلاس هیومن که ساختم شی ای از کلاس تایپ هست و با این متد میتونم بررسی کنم
# print(isinstance(Human, type))  # بررسی میکنه که هیومن ابجکتی یا شی ای از کلاس تایپ هست یای نه
# print(type(type))  # خود تایپ شی ای از کلاس تایپ هست
# ==========================================================================
# s = 'danial'  # یک ابجکتی ایجاد کردم از کلاس str
# print(type(s))
# print(isinstance(s, str))
# print(type(str))
# print(isinstance(str, type))
# print(str.__base__)
# ==========================================================================
# class HumanMeta(type):
#     pass
#
#
# class Human(metaclass=HumanMeta):
#     pass
#
#
# h = Human()
# print(type(h))
# print(type(Human))
# print(type(HumanMeta))
# ==========================================================================
