# -------------------------------------------------
# سه قانون مهم درمورد دنیای شی گرایی
# 1- همه چیز در پایتون یک شی هست
# 2- هر شی حداقل باید نمونه ای از یک کلاس باشد
# 3- یک متغیر یک ارجاع به شی است
#  4- هر کلاسی خود یک شی از کلاس تایپ هستش و همه کلاس ها از کلاسی به اسم ابجکت ارث بری میکنند.
# 5- در ساختار جدید پایتون مفهوم کلاس برابر مفهوم تایپ در نظر گرفته شده است.
# -------------------------------------------------

# ==============================================  3  =============================================================

# -------------------------------------------------

# x = 56  # یک ابجکت ایجاد شده از کلاس بیتاین اینتیجر پایتون
# s = "hello"
#
# print(x, type(x))
# print(s, type(s))
# print(x.__class__)
# print(s.__class__)
# -------------------------------------------------
# وقتی دو تا متغییر مختلف یا ابجکت مختلف رو رو بهم ضرب میکنیم در واقع داریم از یک متد داخلی از کلاسشون استفاده مکنیم
# x = 4
# y = 6
# print(dir(x))
# print(x * y)
# print(x.__mul__(y))
# print(x.__pow__(y))
# -------------------------------------------------

# ==============================================  1 & 2  =============================================================

# -------------------------------------------------
# دستور کلاس کمکمون میکنه که تایپ های جدیدی ایجاد کنیم
# هر کلاسی خودش یک شی از کلاس تایپ هستش
# همه کلاس هایی که توی پایتون ایجاد میشن از کلاس ابجکت ارث بری میکنن

# def A():
#     pass
# print(A.__class__)


# class A:
#     pass
#
#
# print(A)
# print(A.__class__)
#
# print(A.__bases__)  # با این دستور میتونیم پایه های اون کلاس رو ببینم
# print(type.__bases__)  # حتی کلاس تایپ هم از کلاس ابجکت ارث بری میکنه
# -------------------------------------------------
