"""
اشیا: همون چیز هایی هستند که یه رفتار خاص و یه وظیفه خاص رو انجام میدن
"""
# شی گرایی ==> تمایل پیدا کردن برای مدل سازی اشیا
# هرچیز توی پایتون شی هست

# ----------------------------------------------------------------------------
# OOA (object oriented analisys) ==> چیکار باید بکنیم
# OOD (object oriented design) ==> چطور باید انجام بدیم
# OOP (object oriented programming) ==> طرح رو به برناممون تبدیل میکنیم
# ----------------------------------------------------------------------------
