"""
class: کلاس ها شامل یه سری  اتریبیوت و متد هایی که کنار هم دیگه قرار گرفتن
"""

"""
مفهوم کپسوله سازی یا encapsulation:
کپسوله سازی یعنی دسته بندی method & attributesهایی که متد ها روی انها کار میکنن
"""

"""
به این فرایند که میام یه سری از داده هارو از کاربر مخفی میکنم یا اجازه دسترسی به اونها رو نمیدم که میشه data hiding
"""

"""
نکته: کپسوله سازی یه راهی هست برای که ازش استفاده کنم برای پنهان سازی داده ها 
"""

"""
توی پنهان سازی داده ها بیشتر تمرکز روی امنیت داده ها هست ولی
توی کپسوله سازی بیشتر تمرکز روی پنهان کردن پیچیدگی سیستم تمرکز داریم
"""

"""
مفهوم رابط: 
رابط مشخص میکنه اون شی ای که داریم قراره چیکار کنه چه هدفی داره 
"""

"""
نگته: وقتی قراره رابط بنویسیم میگیم
 ک من به چه چیزی نیاز دارم اینکه اون چیزه دقیقا چجوری پیاده سازی شده یا چگونه کارشو انجام میده برای من اهمیتی نداره
"""
