"""
mixins:
یک الگو یا طرح هستش یک شکل از برنامه نویسی شی گرا هستش که یه سری کاربرد هایی رو برای ما فراهم میکنه
میکسین توی مبحث شی گرایی و وراثت چند گانه مطرحه
"""

"""
mixins:
میکسین معمولا شامل متد هستش و هدفش اینه که کلاس های دیگه رو بیاد عملکرد هایی رو بیاد بهش اضافه کنه یعنی فانکشنلیتی هاش رو توسعه بده

در واقع میکسین مجموعه ای از عملکرد ها یا فانکشنلیتی ها است که
اگه حس کنیم کلاسی به اون عملکرده نیاز داره میام از این کلاس میکسین ارث بری میکنیمو اون قابلیت بهش اضافه میشه
"""

"""
ویژگی های mixins: 
1- رابطه هست یک نیست 
2- پیاده سازیش مثل کلاسای دیگه هست و معمولا اخرش کلمه mixin نوشته میشه 
3- از کلاسای میکسین شی ایجاد نمیکنیم چون هدف ما اینه که کلاسای دیگه عملکرد هاشون توسعه پیدا کنن و قابلیت هایی بهشون اضافه بشه
 و هدف ما این نیست که واقعا یک ابجکت جدید یا نوع جدید  داشته باشیم  
"""

"""
توی دو حالت معمولا از mixin استفاده میکنیم 
1- زمانی که من میخوام تعداد زیادی از قابلیت های اختیاری رو برای یه سری از کلاس ها فراهم کنم 
2- یه قابلیت خاصی وجود داره که میخایم تو کل کلاس استفاده کنیم و تو بعضی هاش هم استفاده نکنم 
"""


class WiFiMixin:
    def connect_to_wifi(self):
        print('You are connected to wifi. ')


class MusicMixin:
    def play_music(self):
        print('playing music. ')


class Vehicle:
    def move(self):
        pass


class Car(Vehicle, WiFiMixin):
    pass


class AirPlane(Vehicle, WiFiMixin, MusicMixin):
    pass


class MotorCycle(Vehicle):
    pass


car = Car()
air_plane = AirPlane()


car.connect_to_wifi()
air_plane.connect_to_wifi()
air_plane.play_music()
