# underscore:
# 1- استفاده از (_) به تنهایی
# 2- استفاده از (_) قبل از اسم یک متغیر یا متد یا اتریبیوت
# 3- استفاده از (_) بعد از اسم یک متغیر یا متد یا اتریبیوت


# public ==> name
# private ==>
# protected ==> _name


# -----------  1  ----------------
# for _ in range(10):
#     print('hello')
# --------------------------------

# -----------  1  ----------------
# name, age = ('ali', 12)
# print(f"{name} {age}")

# name, _ = ('ali', 12)
# print(f"{name} {_}")
# --------------------------------

# -----------  1  ----------------
# توی حالت تعاملی هستش که اخرین مقدار نوشته رو توی خودش ذخیره میکنه
# --------------------------------

# -----------  2  ----------------
# class User:
#     def __init__(self, name="", phone=""):
#         self._user_id = id(self)
#         self.name = name
#         self.phone = phone
#
#
# ali = User('ali', '0939')
#
# print(f"{ali._user_id} - {ali.name} - {ali.phone}")
# --------------------------------

# -----------  2  ----------------
# from point import *
#
# print(y)
# print(_x)
# --------------------------------

# -----------  3  ----------------
# min_ = 10
# print(min_)
# --------------------------------
