#  مقدار دیفالت بافر 8192 هست
# import io
# print(io.DEFAULT_BUFFER_SIZE)
# ======================================================================================
"""
وقتی توی تابع open مقدار buffering=0 رو میزارم یعنی بافر نمیخام و مستقیما داخل فایل مینویسه و برای حالت باینری هست
"""
# f = open(file='test2.txt', mode='wb', buffering=0)
#
# f.write(b'mohammad\nsadri')
# f.write(b'danial\nsadri')
# f.write(b'hossein\nakbari')
#
# input('x: ')
# f.close()
# ======================================================================================
"""
وقتی توی تابع open مقدار buffering=1 رو میزارم به معنای line buffering هست یعنی هر خط رو توی یک بافر ذخیره میکنه یعنی خط به خط دیگه 
 و برای حالت غیر باینری هست 
 line buffering:  لاین بافرینگ یعنی به این شکل عمل میکنه وقتی یه خط  به انتها رسید اونو مینویسه
"""

# f = open(file='test2.txt', mode='wt', buffering=1)
#
# f.write('mohammad sadri\n')
# f.write('dania sadri\n')
# f.write('hossein akbari\n')
#
# input('x: ')
# f.close()
# ======================================================================================
"""
وقتی توی تابع open مقدار buffering = -1 رو میزارم همون سایز بافری که به صورت دیفالت داره  یعنی 8192
"""

# f = open(file='test2.txt', mode='wt', buffering=-1)
#
# f.write('mohammad sadri\n')
# f.write('dania sadri\n')
# f.write('hossein akbari\n')
#
# input('x: ')
# f.close()
# ======================================================================================
"""
وقتی توی تابع open مقدار buffering رو یه عدد دلخواه غیر -1و0و1 میزارم یعنی تایید میکنه مقدار دیفالت بافر چقدر باشه و چقدر بتونه ذخیره کنه
"""

# f = open(file='test2.txt', mode='wb', buffering=10)
#
# f.write(b'123456789')
#
#
# input('x: ')
# f.close()
# ======================================================================================
# f = open(file='test2.txt', mode='rt', encoding='utf-8')
# print(f.readlines())
# ======================================================================================
