# t ==> text file
# b ==> binary file
# rt ==> برای خواندن | فایل متنی | اشاره گر میره به ابتدای فایل | در صورت عدم وجود خطا
# wt ==> برای نوشتن | فایل متنی | محتوای قبلی پاک می شود | اشاره گر در ابتدای فایل | در صورت عدم وجود اول ایجاد و سپس باز میشود
# at ==>  برای نوشتن در انتهای فایل | فایل متنی | اشاره گر در انتهای فایل هست | در صورت عدم وجود اول ایجاد و سپس باز میشود |
# xt ==> برای نوشتن | فایل متنی | اشاره گر در ابتدای فایل | در صورت وجود خطا
# rb | wb | ab | xb
# rt+ ==>  برای خواندن و نوشتن | در صورت عدم وجود خطا
# wt+ ==> برای خواندن و نوشتن | متن قبلی پاک میشه | در صورت عدم وجود اول ایجاد و سپس باز میشود
# at+ ==> برای خواندن و نوشتن | برای نوشتن در انتهای فایل
# xt+ ==> برای خوانندن و نوشتن | درصورت وجود خطا
# rb+ | wb+ | ab+ | xb+
# r+b | w+b | a+b | x+b


# f = open(file='test11.txt', mode='xt+')
#
#
# print(f.readline(), end='')
# print(f.write('danial sadri'))
# print(f.readline(), end='')
