"""
# buffer ==> یه حافظه واسطه یا میانجی بین دو تا واحد مجزا
# buffer ==> بافر یا حافظه میانجی که هم بصورت سخت افزاری و نرم افزاری میتونه وجود داشته باشه اطلاعات و داده های فرستاده شده  بین دو تا واحد مجزا تو یه سیستم رو بصورت موقت توی خودش نگه میداره
"""
# ===========================================================================
import os

f = open(file='test2.txt', mode='wt', encoding='utf-8')

f.write('reza\ndolati\n01\n')
f.write('danial\nsadri\n01')

f.flush()  # بافر داخلی رو خالی میکنه و داخل فایل مینویسه |  از بافر داخلی منتقل میشه به بافر سیستم عامل و بعد به هارد دیسک متنقل میشه
os.fsync(f)  # اگر میخای مطمعن بشی از بافر سیستم عامل منتقل میشه به هارد دیسک از این متد استفاده کن


input('x: ')
f.close()
