# شناسه یا identifier
# ---------------------------------------------------------------------------------------
# متغیر فقط با حروف انگلیسی بزرگ و کوچک و اندراسکور شروع میشه
# A = 5
# a = 5
# _a = 5
# _A = 5
# ---------------------------------------------------------------------------------------
# در تعریف متغیر در ادامه آن میشه از اعداد یا حروف انگلیسی بزرگ و کوچک و اندر اسکور استفاده کرد

# number
# English
# _

# test123 = 'ali'
# testTest = 'ali'
# test_test = 'ali'
# ---------------------------------------------------------------------------------------
