# =============================  1  =================================
# دو عدد از کاربر گرفته و اعداد مابین ان را نمایش دهید

# -------------------------------------------------------------
# x = int(input('x: '))
# y = int(input('y: '))
#
# min_ = min(x, y)
# max_ = max(x, y)
#
# while min_ <= max_:
#     print(min_)
#     min_ += 1
# -------------------------------------------------------------
# x = int(input('x: '))
# y = int(input('y: '))
#
# min_ = min(x, y)
# max_ = max(x, y)
#
#
# for i in range(min_, max_+1):
#     print(i)
# -------------------------------------------------------------

# =============================  2  =================================
# برنامه ای بنویسید که دو عدد صحیح را گرفته و مقسوم علیه های مشترکشان را نمایش دهد
# 12 ==> 1,2,3,4,6,12
# 24 ==> 1,2,3,4,6,8,12,24

# -------------------------------------------------------------
# x = int(input('x: '))
# y = int(input('y: '))
# m = min(x, y)
# for i in range(1, m+1):
#     if x % i == 0 and y % i == 0:
#         print(i, end='\t')
# -------------------------------------------------------------

# =============================  3  =================================
# برنامه ای بنویسید که دو عدد صحیح را گرفته و بزرگ ترین مقسوم علیه مشترکشان را نمایش دهد.

# ------------------------روش غیر بهینه -------------------------------------
# x = int(input('x: '))
# y = int(input('y: '))
# m = min(x, y)
#
# temp = 1
# for i in range(1, m+1):
#     if x % i == 0 and y % i == 0:
#         if i > temp:
#             temp = i
# print(temp)
# -----------------------------روش بهینه --------------------------------
# x = int(input('x: '))
# y = int(input('y: '))
# m = min(x, y)
#
# for i in range(m, 0, -1):
#     if x % i == 0 and y % i == 0:
#         print(i)
#         break
# -------------------------------------------------------------

# =============================  4  =================================
# برنامه ای بنویسید که دو عدد صحیح را گرفته و کوچک ترین مضرب مشترکشان را چاپ کند
# 12 ==> 12, 24, 36, 48 ...
# 6 ==> 6, 12, 18, 24, 30...

# -------------------------------------------------------------
# x = int(input('x: '))
# y = int(input('y: '))
#
# min_ = min(x, y)
# max_ = max(x, y)
#
# for i in range(1, min_ + 1):
#     if (max_ * i) % min_ == 0:
#         print(max_ * i)
#         break
# -------------------------------------------------------------
# x = int(input('x: '))
# y = int(input('y: '))
#
# min_ = min(x, y)
# max_ = max(x, y)
#
# i = max_
# while i % min_ != 0:
#     i += max_
# print(i)
# -------------------------------------------------------------

# =============================  5  =================================
# برنامه ای بنویسید که عدد صحیحی را گرفته و تعداد رقم هایش را نمایش دهد

# -------------------------------------------------------------
# x = int(input('x: '))
# i = 0
# while x > 0:
#     x //= 10
#     i += 1
# print(i)
# -------------------------------------------------------------

# =============================  6  =================================
# برنامه ای که تعداد سطر را از کاربر گرفته و شکل زیر را رسم کند

# -------------------------------------------------------------
# n = int(input('n: '))
# for i in range(1, n + 1):
#     print(" " * (n - i), end='')
#     print("*" * i)
# -------------------------------------------------------------
# n = int(input('n: '))
# for i in range(1, n+1):
#     for j in range(0, n-i):
#         print(" ", end="")
#     for z in range(1, i+1):
#         print('*', end='')
#     print()
# -------------------------------------------------------------

# =============================  7  ================================
"""
ما یک لیست ده تایی از اسم های مختلف داریم. برنامه ای بنویسید که کاربر یک اسم را در ذهن خود بگیرد و برنامه حدس بزند آن اسم چیست.
سپس از کاربر بپرسد که درست حدس زد است یا خیر. اگر اشتباه بود اسم دیگری حدس بزند. برنامه نباید اسمی را که قبلا کاربر گفته است اشتباه است، دوباره نشان دهد.

مثلا لیست ما شامل [“C”, “B”,”A”] است. کاربر در ذهن خود A را انتخاب میکند. برنامه حدس میزند حرف انتخابی B است و
 میپرسد آیا درست حدس زده ام؟ کاربر میگوید نه. برنامه دوباره حدس میزند A و میپرسد درست حدس زده ام؟ کاربر میگوید بعله و برنامه تمام میشود.
"""

# -------------------------------------------------------------
# from random import choice
#
# names = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
# names_cp = names.copy()
#
# while True:
#     if len(names_cp) == 0:
#         break
#     cmp_choice = choice(names_cp)
#     ans = input(f"Is your guess {cmp_choice}?(y/n): ")
#     if 'y' in ans.lower():
#         print('you wan!')
#         break
#     names_cp.remove(cmp_choice)
# -------------------------------------------------------------
