# ==============================  1  ==========================================
# میخایم اعداد زوج یک رقمی و دو رقمی رو چاپ کنیم

# ------------ راه نسبتا اشتباه ------------------
# n = 0
# while n < 100:
#     print(n)
#     n += 1
# -----------------  راه درست -------------------
# n = int(input('n: '))
# while n < 100:
#     if n % 2 == 0:
#         print(n)
#     n += 1
# ==============================  2  ==========================================
# برنامه ای بنویسید که هم بر 3 هم بر 7 بخش پذیر باشد

# n = 1
# while n < 1000:
#     if (n % 3 == 0) and (n % 7 == 0):
#         print(n)
#     n += 1
# ==============================  3  ==========================================
#  میخایم مثلث چاپ کنیم
# row = 1
# rows = int(input('rows: '))
# while row <= rows:
#     print('*'*row)
#     row += 1
# ==============================  4  ==========================================
#  میخایم مثلث رو برعکس چاپ کنیم
# rows = int(input('rows: '))
# while rows >= 1:
#     print('*'*rows)
#     rows -= 1
# ==============================  5  ==========================================
# میخایم مقسوم علیه های یه عددی رو چاپ کنم یعنی این عددی که من دارم بر چه عدد های بخش پذیر هست
# n = int(input('Enter a number: '))
# i = 1
# l = []
# while i <= n:
#     if n % i == 0:
#         l.append(i)
#     i += 1
#
# print(l)
# ==============================  6  ==========================================
#  میخایم بفهمیم که یه عدد کامل هست یا نه
#  یعنی عددی کامل هست که اگر مقسوم علیه هاش بغیر خودش با هم جمع کنیم خود عدد بدست بیاد
# n = int(input('Enter a number: '))
# i = 1
# c = 0
# while i < n:
#     if n % i == 0:
#         c += i
#     i += 1
#
# if c == n:  # 496, 28, 6
#     print('yes')
# else:
#     print('no')

# ==============================  7  ==========================================
#  یه سری از جمله های سری فیبوناتچی رو چاپ کنیم
# 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55
#    a, b

# i = 1
# a, b = 0, 1
# while i <= 20:  # i = 6 , a = 5, b = 8
#     print(a)
#     a, b = b, a+b  # a = 5 , b = 8
#     i += 1
