# ============================  1 ========================================== break
# break :  اگه از دستور بریک استفاده کنیم دقیقا هر وقت به این دستور رسید از حلقه من خارج میشه

# -----------------------------------------------------------
# i = 0
# while i <= 20:
#     print(i)
#     if i == 5:
#         break
#     i += 1
# -----------------------------------------------------------
# یه تعداد عدد از کاربر بگیرم و چاپ کنم

# n = float(input('n: '))
# Min = n
#
# while True:
#     s = input('Do You Continue?')
#     if s.lower() == 'no':
#         break
#     n = float(input('n: '))
#     if n < Min:
#         Min = n
#
# print(Min, 'is smallest number!')
# --------------------------------------------------------------
# یه تعداد عدد از کاربر بگیرم و چاپ کنم(روش بهینه تر)

# Min = float('inf')
# while True:
#     n = float(input('n: '))
#     if n < Min:
#         Min = n
#     s = input('do you continue?')
#     if s.lower() == 'no':
#         break
#
# print(Min, 'is smallest number!')
# -----------------------------------------------------------

# ============================  2 ========================================== continue
# continue: اگر از دستور کانتیونیو استفاده کنیم دقیقا هر وقت رسید
# به کانتینیو میره اول حلقه و ادامه دستورات  بعد کانتینیو اجرا نمیشه

# -----------------------------------------------------------
# i = 0
# while i < 10:
#     i += 1
#     if i % 3 == 0:
#         continue
#     print(i)
# -----------------------------------------------------------

# ============================  3 ========================================== else
#  else: اگر از الس استفاده کنیم زمانی الس اجرا میشه که حلقه من بصورت نرمال به پایان برسه

# -----------------------------------------------------------
# i = 0
# while i < 10:
#     i += 1
#     if i % 3 == 0:
#         continue
#     print(i)
# else:
#     print('End')

# -----------------------------------------------------------
# یه عدد از کاربر بگیرم و بفهمم این عددی که وارد کرده اول هست یا نه
#  عدد اول یعنی عددی هستند که به غیر خودشون و یک هیچ مقسوم علیه دیگه ای ندارن یعنی به هیچ چیز غیر یک و خودشون بخش پذیر نیستن

# n = int(input('n: '))  # 5
# i = 2
#
# if n > 1:
#     while i < (n // 2) + 1:  # i = 5 | n = 5
#         if n % i == 0:
#             print(f"{n} is not a prime number")
#             break
#         i += 1
#     else:
#         print(f"{n} is a prime number")
# else:
#     print(f"{n} is not a prime number")
# -----------------------------------------------------------
