# =================================  1  ===============================================
# # loop 1
# i = 1
# while i <= 10:
#     # loop 2
#     j = 1
#     while j <= 10:
#         print('\t', j)
#         j += 1
#     print(i)
#     i += 1
# =================================  2  ===============================================
#  عناصری که داخل این لیسته رو میخام چاپ کنم

# l = ['ali', 'hasan', 'hossein', 'akbar', 'asghar', 'danial', 'mohammad', 'mohsen']
# i = 0
# while i < len(l):
#     print(l[i])
#     i += 1
# =================================  3  ===============================================
#  عناصری که داخل این لیسته رو میخام چاپ کنم و هر کلمه رو یکیشو حروف بزرگ کنم یکیشو کوچک

# l = input('name: '). split(' ')
# i = 0
# while i < len(l):
#     s = l[i]
#     j = 0
#     while j < len(s):
#         if j % 2 == 0:
#             print(s[j].upper(), end=' ')
#         else:
#             print(s[j], end=' ')
#         j += 1
#     print()
#     i += 1
# =================================  4  ===============================================
# میخایم یه جدول ضرب  ده در ده چاپ کنیم

# i = 1
# while i <= 10:
#     j = 1
#     while j <= 10:
#         print(i*j, end='\t')
#         j += 1
#     print()
#     i += 1

# =================================  5  ===============================================
# --------------- 1 -----------------------
# i = 1
# while i <= 10:
#     print('*'*i)
#     i += 1
# --------------- 2 -----------------------
# i = 1
# while i <= 5:
#     j = 1
#     while j <= i:
#         print('*', end='')
#         j += 1
#     print()
#     i += 1
