# ================================  1  =====================================================================
# تابع enumerate

# ----------------------------------------
# l = ['a', 'b', 'c', 'd', 'e', 'f']
# for i in range(0, len(l)):
#     print(f"{i}: {l[i]}")
# ----------------------------------------
# print(list(enumerate(['a', 'b', 'c', 'd', 'e', 'f'])))
# ----------------------------------------
# نکته: i  ایندکسش هست و j خود عنصر هست
# l = ['a', 'b', 'c', 'd', 'e', 'f']
# for i, j in enumerate(l):
#     print(f"{i}: {j}")
# ----------------------------------------

# ================================  2  =====================================================================
#  تابع zip

# ----------------------------------------
# x = ['reza', 'ali', 'danial', 'hossein', 'hasan', 'akbar']
# y = [21, 23, 34, 45, 65, 67]

# for i in range(0, len(x)):
#     print(f"name: {x[i]} | age: {y[i]}")
# ----------------------------------------
# x = ['reza', 'ali', 'danial', 'hossein', 'hasan', 'akbar']
# y = [21, 23, 34, 45, 65, 67]
#
# for i, j in zip(x, y):
#     print(f"{i}: {j}")
# ----------------------------------------

# ================================  3  =====================================================================
# تابع  reversed و sorted
# تابع reversed وقتی بهش یه لیست میدیم برعکس چاپ میکنه
# تابع sorted وقتی یه لیستی بهش میدیم مرتب میکنه اگه کلمه باشه بر اساس حروف الفبا چاپ میکنه

# ----------------------------------------
# x = ['reza', 'ali', 'danial', 'hossein', 'hasan', 'akbar']
#
# for i in reversed(x):
#     print(i)
# ----------------------------------------
# x = ['reza', 'ali', 'danial', 'hossein', 'hasan', 'akbar']
# y = [21, 23, 34, 45, 65, 67]
#
# for i in sorted(x):
#     print(i)
# ----------------------------------------
# x = ['reza', 'ali', 'danial', 'hossein', 'hasan', 'akbar']
#
# for i in reversed(sorted(x)):
#     print(i)
# print('=' * 30)
# for i in sorted(x, reverse=True):
#     print(i)
