from random import random, seed, randint, uniform, randrange, choice, sample, shuffle

# ----------------------
# print(random())  # عدد تصادفی تولید میکنه بین 0 و 1 ولی دقیقا خود 1 نیست
# ----------------------
# seed(9)  # وقتی تابع seed  رو نوشتم بر اساس اون عددی که نوشتم یه عدد تصادفی تولید میشه
# print(random())
# ----------------------
# فرمول تولید اعداد بین عدد که میخام
# min + (random * (max-min)
# print(5 + (random() * (10-5)))
# print(uniform(5, 15))  # با استفاده از تابع uniform میتونیم بازه بین 5 تا 15  رو چاپ کنیم ولی با اعشار نشون میده
# print(randint(5, 15))  # با استفاده از تابع randint عدد تصادفی بدون اعشار تولید میشه
# ----------------------
# print(randrange(5, 100, 2))  # عدد تضادفی تولید میکنه ولی میتونی گام حرکت براش تولید کنی
# ----------------------
# x = ['a', 'b', 'c', 'd', 'e', 'f']
# for _ in range(10):
#     print(x[randint(0, len(x) - 1)])
# for _ in range(10):
# print(choice(x))  # برای وقتیه که میخام شانسی کیو انتخاب کنه داخل لیست
# ----------------------
# x = ['a', 'b', 'c', 'd', 'e', 'f', 1, 2, 3, 4, 5]
# print(sample(x, 5))  # میاد یه تعدادیو که من میگم چند تا از این لیستم برمیداره و یه لیست تشکیل میده
# ----------------------
# x = ['a', 'b', 'c', 'd', 'e', 'f', 1, 2, 3, 4]
# shuffle(x)  # این میاد شانسی لیست منو بر میزنه و روی خود لیست اعمال میکنه
# print(x)
# -----------------------------------------------------------------------------------------------------------
# یه سکه ای دارم هزار بار بندازم ببینم چند بار شیر میاد و چند بار خط
# coin = ['shir', 'khat']
# sh = 0
# kh = 0
# for _ in range(1000):
#     r = choice(coin)
#     if r == 'shir':
#         sh += 1
#     else:
#         kh += 1
# print(f"shir: {sh} kh: {kh}")
# -----------------------------------------------------------------------------------------------------------
# میخایم یه تاس بندازیم و ببینیم این وجه های روش چند بار میاد

# tas = {1: 0, 2: 0, 3: 0, 4: 0, 5: 0, 6: 0}
#
# for _ in range(1000):
#     tas[randint(1, 6)] += 1
# print(tas)
