"""
assert: برای زمانی استفاده میشه که انتظار دارم یه شرطی درست باشه و انتظار اینکه خلاف اون باشه رو ندارم
  و میام قبل اون دستور این اسرت و مینویسم و میگم این برنامه باید طبق انتظار من جلو بره
  اگه طبق انتظار من جلو رفت و اون شرط درست بود که برنامه روان خودشو طی میکنه ولی اگه اون شرطه برقرار نبود و طبق انتظار
  من جلو نرفت اون وقت یک استثنایی رخ میده و یکAssertionError برای من نشون میده که من میتونم بفهمم که اینی باید درست باشه
  این اتفاق براش افتاده
  از assert برای دیباگ و زمان تست نویسی استفاده میشه معمولا
"""

# from warnings import warn
#
#
# def func(x: int, y: int):
#     assert isinstance(x, int) and isinstance(y, int), "x and y can't be strings!!!"
#     print(x + y)
#
#
# func(8, '6535')
# print('ok!!!')

