# setup.cfg | setup.py ==>  برای پیکربندی پروژه استفاده میشه | ستاپ.سی اف جی  مربوط به دستوراتی که توی خط فرمان وجود داره و یه رابط برای خط فرمان هستش
# README.md | README.rst ==> برای توصیف پروژه ما هستش و در مورد پروژه صحبت بکنه
# MANIFEST.in ==> برای معرفی کردن فایل های غیر پایتونی که توی اون پروژه وجود دارن استفاده میشه
# requirements.txt ==> برای پیش نیاز های پروژه هستش
# LICENSE ==> پروان انتشار پروژه ما هستش که کارشون اینه یه کپی میگیرن از متن پروانه های اپن سورس مثل چی پی ال | ام ای تی| بی اس تی و اینجا قرار میدن
# docs ==> داکیومنت پروژه هستش که راهنما اموزش توضیحات اینجا قرار میگیرن
# tests ==> تست های پروژه ما اینجا قرار میگیرن
