# script | module | package | library | framework

# script ==>  همه فایل های پایتونی که داخلش یه سری کد هایی می نویسم که قراره مستقیما اجرا بشه و یه سریی کارایی رو انجام بده
# module ==> همه فایل های پایتونی که که قرار نیست مستقیما اجرا بشه بلکه قراره توسط اسکریپت های دیگه یا فایل پایتونی دیگه ایمپورت و استفاده بشه
#  تمام فایل های .py ماژول هستند
# package ==> مجموعه ای از ماژول هایی که مرتبط به هم هستند و یه وظیفه خاصیو انجام میدن  میتونیم جمع اوری کنیم و قرار بدیم داخل یه دایرکتوری یا پوشه و تشکیل یه پکیج رو بدن
# library ==> چند تا ماژول تشکیل یک پکیج رو میدن و چند تا پکیج تشکیل یک کتابخانه یا لایبرری رو میدن
# framework ==> 


# =========================================================
# def print_name(name):
#     return f"my name is {name}"
#
#
# def print_max(x, y):
#     return max(x, y)
#
#
# if __name__ == "__main__":
#     print(print_max(34, 45))
#     print(print_name('danial'))
# ===========================================================
