#  فضای نام  یا نیم اسپیس ==> فضای نام ما مشخص میکنه که چه نام هایی باید توی اون فضا تعریف بشن که توی یه دیکشنری قرار میگیرن و نام  ها و شی ها مشخص میشن
# حوزه یا اسکوپ ==> مشخص میکنه توی هر حوزه ای چه فضای نام هایی در دسترس هست
# فضای نام میگه که کدوم شناسه در دسترسه ولی حوزه میگه که کجاها فضای نام در دسترسه
# ===============================================================
# print(dir('__builtins__'))  # تمام اسم هایی که توی فضای نام بیلتین هستن رو چاپ میکنه
# print(globals())  # اسم هایی که تو فضای نام گلوبال یعنی این ماژول تعریف شده اند رو چاپ میکنه
# =======================  globals  ==================================================
# x = 5
# y = 7
# def A():
#     pass
# globals()['z'] = 99
# print('y: ', y)
# print(globals())
# =======================  local & Enclosed  =========================================
# def A():  # فضای نام Enclosed
#     x = 10
#     y = 20
#     print(f"a = {x} b= {y}")
#     print(locals())
#
#     def A2():  # فضای نام local
#         x = 16
#         y = 22
#         print(f"a = {x} b= {y}")
#         print(locals())
#
#     A2()
#
#
# def B():  # فضای نام local
#     x = 15
#     y = 25
#     print(f"a = {x} b= {y}")
#     print(locals())
#
#
# A()
# B()
