# pass by value ==> یعنی یه کپی از مقدار اون ارگومانه ارسال میشه
# pass by reference ==> یه ارجاع از  ارگومان ارسال میشه و با تغییر کردن مقدار اون داخل تابع بیرون از تابع هم تغییر میکنه
# اشیایی که میوتبل یا تغییر پذیر هستن توی پایتون رفتارشون pass by reference هست و تغییرات روشون میمونه
# ==================================
# def func(a):
#     a += 1
#     print(a)
# func(5)
# =================================
# def func(a):
#     a += 1
#     print(a)
#
#
# x = 1
# func(x) # تغییر نا پذیر
# print(x)
# =================================
# def func(a):
#     a += [4, 5, 6]
#     print(a)
#
#
# x = [1, 2, 3]
# func(x)
# print(x)
# =================================
# def func(a):
#     a['c'] = 3
#     print(a)
#
#
# x = {'d': 4, 'e': 5, 'f': 6}
# func(x)
# print(x)
# =================================
# def func(a):
#     a |= {6, 7, 8, 9}
#     print(a)
#
#
# x = {1, 2, 3, 4, 5}
# func(x)
# print(x)
# =================================
# def func(a):
#     a[0][1] = 0
#     print(a)
#
#
# a = [[1, 2, 3], 2, 3]
# func(a)
# print(a)
# =================================
# from copy import deepcopy
# def func(a):
#     a[0][1] = 0
#     print(a)
#
#
# a = [[1, 2, 3], 2, 3]
# func(deepcopy(a))
# print(a)
# =================================
