# ========================  1  ==============================
# برنامه ای بنوسید که با استفاده از لامبدا اعداد زوج و فرد را در یک لیست از اعداد صحیح بشمارد

# -------------------------------------------
# list_ = [1,2,3,4,5,6,7,8,9,10]
# print(f"list: {list_}")

# even = len(list(filter(lambda x: x % 2 == 0, list_)))
# print(f"len even: {even}")

# odd = len(list(filter(lambda x: x % 2 != 0, list_)))
# print(f"len odd: {odd}")
# -------------------------------------------

# ========================  2  ==============================
#   لیستی از تاپل ها به شکل [('reza', 22), ('danial', 55)] داریم .
#   با استفاده از لامبدا ها برنامه ای بنویسید
#   که این لیست را بر اساس اعداد موجود در تاپل مرتب کند

# -------------------------------------------
# list_ = [('reza', 17), ('ali', 6), ('hossein', 29), ('danial', 8)]
# print(f"list: {list_}")

# list_.sort(key=lambda x: x[1])
# print(f"sorted list: {list_}")
# -------------------------------------------

# ========================  3  ==============================
# [{'name': 'apple', 'weight': '50', 'color': 'red'}, ]
# لیستی از دیکشنری ها به شکل بالا داریم . با استفاده از لامبدا  برنامه ای بنویسید
# که این لیست را بر اساس رنگ موجود در دیکشنری مرتب کند

# -------------------------------------------
# list_ = [
#         {'name': 'apple', 'weight': 50, 'color': 'red'},
#         {'name': 'banana', 'weight': 80, 'color': 'yellow'},
#         {'name': 'coconut', 'weight': 30, 'color': 'brown'},
#         {'name': 'apple', 'weight': 20, 'color': 'orange'},
# ]
# print(f"list: {list_}")
#
# list_.sort(key=lambda x: x['color'])
# print(f"sorted list: {list_}")
# -------------------------------------------

# ========================  4  ==============================
# برنامه ای بنویسید تا لیستی از اعداد صحیح را با استفاده از لامبدا به زوج ها و فرد ها فیلتر کند.

# -------------------------------------------
# list_ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(f"list: {list_}")
#
# even = list(filter(lambda x: x % 2 == 0, list_))
# print(f"even: {even}")
#
# odd = list(filter(lambda x: x % 2 != 0, list_))
# print(f"odd: {odd}")
# -------------------------------------------

# ========================  5  ==============================
# با استفاده از لامبدا یک برنامه ای بنویسید تا هر عدد را در لیستی از اعداد صحیح مربع و مکعب کند

# -------------------------------------------
# list_ = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(f"list: {list_}")
#
# square = list(map(lambda x: x ** 2, list_))
# print(f"square list: {square}")
#
# cube = list(map(lambda x: x ** 3, list_))
# print(f"square list: {cube}")
# -------------------------------------------

# ========================  6  ==============================
# با استفاده از لامبدا برنامه بنویسید تا بفهمید که ایا یک رشته داده شده با یک کاراکتر مشخص شروع میشود یا خیر.

# -------------------------------------------
# s = input('Enter a string: ')
# starts_with = lambda s: True if s.startswith('a') else False
# print(starts_with(s))
# -------------------------------------------

# ========================  7  ==============================
# با استفاده از لامبدا برنامه ای بنویسید که بررسی کند که ایا یک رشته داده شده عددی هست یا خیر

# -------------------------------------------
# s = '4'
#
# is_num = lambda s: s.replace('.', '', 1).isdigit()
# print(is_num('5.7'))
# -------------------------------------------
