# parameter ==> ورودی های تابع جایی که تعریفشون کردم بهشون میگیم پارامتر
# argument ==> جایی که دارم تابع رو صدا میزنم و دارم ورودی هارو مشخص میکنیم بهش میگیم ارگومان
# باید سعی کنیم تابع های ما کوچیک باشه حداکثر 20 خط کد
# سعی کنیم هر تابع ای یه کار مشخص رو انجام بده
# سعی کنیم اسامی که برای تابع مشخص می کنیم کارکرد اون تابع رو توصیف کنیم
# پارامتر های کمتری مشخص کنیم یا مشخص کنیم
# تابع شما یه کار خاصی رو انجام بده
# -------------------------------------------------
# def cube(x):
#     return x ** 3
#
#
# y = int(input('y: '))
# print(cube(y))
# -------------------------------------------------
# def cube():
#     x = int(input('x:'))
#     return x ** 3
#
#
# print(cube())
# -------------------------------------------------
# def cube():
#     x = int(input('x: '))
#     print(x ** 3)
#
#
# cube()
# -------------------------------------------------
# def cube():
#     x = int(input('x: '))
#     print('ok')
#     x += 1
#     return x ** 3
#
#
# print(cube())
# -------------------------------------------------
# def cube(x):
#     return x ** 3
#
#
# y = int(input('y: '))
# n = cube #  اینجا اگه پرانتز های تابع رو نزارم یعنی اینکه خود تابع رو گذاشتم داخل اون متغیر
# print(n(y))
# -------------------------------------------------
