"""
تابع بازگشتی: هر تابعی که داخل خودش خودش رو صدا بزنه

ساختار تابع بازگشتی دو بخش اصلی داره :
1- إشرط توقف اونجایی که مشخص میکنه دیگه بازگشت رو متوقف کن
2-  همونجایی که دوباره باعث میشه چرخه ادامه پیدا کنه و تابع صا زده بشه
"""


# ==================================== 1 ===============================
# فاکتوریل با استفاده از تابع بازگشتی
# 5! = 5 * 4 * 3 * 2 * 1
# 5! = 5 *  4!

# ----------------------------------------------
# def fact(x):
#     f = 1
#     for i in range(1, x + 1):
#         f *= i
#     return f
# ----------------------------------------------
# def rec_fact(x):
#     if x == 0 or x == 1:
#         return 1
#     return x * rec_fact(x-1)
#
#
# print(rec_fact(5))
# ----------------------------------------------
