# normal
# name = value
# normal & name = value
# *iterable(str, list, tuple, set, ....)
# **dict
# ------------------  normal  ----------------------------------------
# def func(a, b, c):
#     print(f"a= {a} b= {b} c= {c}")
#
#
# func(1, 2, 3)  # normal
# ------------------  name = value  ----------------------------------
# def func(a, b, c):
#    print(f"a= {a} b= {b} c= {c}")
#
#
# func(a=1, b=2, c=3)  # name = value # جابه جا هم میتونه باشه
# ------------------  normal & name = value  -------------------------
# def func(a, b, c):
#     print(f"a= {a} b= {b} c= {c}")
#
#
# func(1, c=12, b=32)  # normal & name = value # اول باید موقعیتی باشه بعدش سینتکس نام مقدار
# ---------------------  *iterable  ----------------------------------
# def func(a, b, c):
#     print(f"a= {a} b= {b} c= {c}")
#
#
# func(*[81, 26, 34])  # *iterable # اول ستاره و بعدش ایتریبل رو مینیسیم و داخلش مقدار رو میدم
# ---------------------  **dict  -------------------------------------
# def func(a, b, c):
#     print(f"a= {a} b= {b} c= {c}")
#
#
# func(**{'a': 5, 'b': 2, 'c': 8})  # **dict # جا به جا هم میتونه باشه
# --------------------------------------------------------------------
