#   * = هر جایی این ستاره رو استفاده کنم پارامتر های بعد از اون موقعی که دارم ارگومان هاشو مینویسم باید به شکل نام مقدار نوشته بشه
# / =  هر جایی این اسلش رو استفاده کنم پارامتر های قبل از اون موقعی که دارم ارگومان هاشو مینویسم باید به شکل موقعیتی نوشته بشه
# ---------------------------  *  ------------------------------------
# def func(a, *, b, c):
#     print("a=", a)
#     print("b=", b)
#     print("c=", c)
#
#
# func(1, b=2, c=3)
# ---------------------------  /  ------------------------------------
# def func(a, b, c, /, d, e):
#     print("a=", a)
#     print("b=", b)
#     print("c=", c)
#     print("d=", d)
#     print("e=", e)
#
#
# func(2, 4, 6, d=5, e=22)
# ---------------------------  * & /  --------------------------------
# def func(a, b, /, c, *, d, e):
#     print("a=", a)
#     print("b=", b)
#     print("c=", c)
#     print("d=", d)
#     print("e=", e)
#
#
# func(11, 33, c=55, d=44, e=66)
# --------------------------------------------------------------------
